; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.9 = type { [2 x i32]*, [80 x i32]*, i32*, %struct.filter* }
%struct.filter = type { i32, i8, i8, i8, i32, i32, [4 x i32], [4 x i32], i8, i8, i8, i8, i8, i16, i8, i16, i8, i8, [2 x i8], %struct.tcpopts, %struct.udpopts, %struct.icmpopts }
%struct.tcpopts = type { i8, i16, i8, i16, i16, [2 x i8] }
%struct.udpopts = type { i8, i16, i8, i16 }
%struct.icmpopts = type { i8, i8, i8, i8 }
%struct.anon.10 = type { [6 x i32]*, i32*, %struct.datarec*, [5 x i32]* }
%struct.datarec = type { i64, i64 }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.0 }
%union.anon.0 = type { [4 x i32] }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon.2 }
%union.anon.2 = type { %struct.anon.3 }
%struct.anon.3 = type { i32, i32 }
%struct.icmp6hdr = type { i8, i8, i16, %union.anon.5 }
%union.anon.5 = type { [1 x i32] }
%struct.icmphdr = type { i8, i8, i16, %union.anon.6 }
%union.anon.6 = type { i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "filters_map", scope: !2, file: !3, line: 49, type: !384, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !53, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/opt/web-ebpf-xdp/ebpf-xdp/src", checksumkind: CSK_MD5, checksum: "255867b589c5afc8434f5bc5d92b30ae")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5431, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "5ad8bc925dae1ec87bbb04b3148b183b")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !52, line: 25, baseType: !48)
!52 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!53 = !{!54, !345, !348, !0, !370, !378}
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "____fmt", scope: !56, file: !3, line: 612, type: !340, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "xdp_prog_main", scope: !3, file: !3, line: 223, type: !57, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !70)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !60}
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5442, size: 192, elements: !62)
!62 = !{!63, !65, !66, !67, !68, !69}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !61, file: !6, line: 5443, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !61, file: !6, line: 5444, baseType: !64, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !61, file: !6, line: 5445, baseType: !64, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !61, file: !6, line: 5447, baseType: !64, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !61, file: !6, line: 5448, baseType: !64, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !61, file: !6, line: 5450, baseType: !64, size: 32, offset: 160)
!70 = !{!71, !72, !73, !74, !75, !79, !80, !92, !139, !167, !211, !234, !256, !265, !266, !268, !271}
!71 = !DILocalVariable(name: "ctx", arg: 1, scope: !56, file: !3, line: 223, type: !60)
!72 = !DILocalVariable(name: "data_end", scope: !56, file: !3, line: 225, type: !46)
!73 = !DILocalVariable(name: "data", scope: !56, file: !3, line: 226, type: !46)
!74 = !DILocalVariable(name: "action", scope: !56, file: !3, line: 233, type: !64)
!75 = !DILocalVariable(name: "nh", scope: !56, file: !3, line: 236, type: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !3, line: 17, size: 64, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !76, file: !3, line: 18, baseType: !46, size: 64)
!79 = !DILocalVariable(name: "nh_type", scope: !56, file: !3, line: 237, type: !59)
!80 = !DILocalVariable(name: "eth", scope: !56, file: !3, line: 240, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !83, line: 168, size: 112, elements: !84)
!83 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!84 = !{!85, !90, !91}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !82, file: !83, line: 169, baseType: !86, size: 48)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 48, elements: !88)
!87 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !{!89}
!89 = !DISubrange(count: 6)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !82, file: !83, line: 170, baseType: !86, size: 48, offset: 48)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !82, file: !83, line: 171, baseType: !51, size: 16, offset: 96)
!92 = !DILocalVariable(name: "ip6h", scope: !56, file: !3, line: 241, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !95, line: 118, size: 320, elements: !96)
!95 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "4f074a871dc410c98906d34687654389")
!96 = !{!97, !99, !100, !104, !105, !106, !107}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !94, file: !95, line: 120, baseType: !98, size: 4, flags: DIFlagBitField, extraData: i64 0)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !87)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !94, file: !95, line: 121, baseType: !98, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !94, file: !95, line: 128, baseType: !101, size: 24, offset: 8)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 24, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 3)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !94, file: !95, line: 130, baseType: !51, size: 16, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !94, file: !95, line: 131, baseType: !98, size: 8, offset: 48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !94, file: !95, line: 132, baseType: !98, size: 8, offset: 56)
!107 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !95, line: 134, baseType: !108, size: 256, offset: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !95, line: 134, size: 256, elements: !109)
!109 = !{!110, !134}
!110 = !DIDerivedType(tag: DW_TAG_member, scope: !108, file: !95, line: 134, baseType: !111, size: 256)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !108, file: !95, line: 134, size: 256, elements: !112)
!112 = !{!113, !133}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !111, file: !95, line: 134, baseType: !114, size: 128)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !115, line: 33, size: 128, elements: !116)
!115 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !114, file: !115, line: 40, baseType: !118, size: 128)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !114, file: !115, line: 34, size: 128, elements: !119)
!119 = !{!120, !124, !128}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !118, file: !115, line: 35, baseType: !121, size: 128)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !118, file: !115, line: 37, baseType: !125, size: 128)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !118, file: !115, line: 38, baseType: !129, size: 128)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !52, line: 27, baseType: !64)
!131 = !{!132}
!132 = !DISubrange(count: 4)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !111, file: !95, line: 134, baseType: !114, size: 128, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !108, file: !95, line: 134, baseType: !135, size: 256)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !108, file: !95, line: 134, size: 256, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !135, file: !95, line: 134, baseType: !114, size: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !135, file: !95, line: 134, baseType: !114, size: 128, offset: 128)
!139 = !DILocalVariable(name: "iph", scope: !56, file: !3, line: 242, type: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !142, line: 87, size: 160, elements: !143)
!142 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !154}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !141, file: !142, line: 89, baseType: !98, size: 4, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !141, file: !142, line: 90, baseType: !98, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !141, file: !142, line: 97, baseType: !98, size: 8, offset: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !141, file: !142, line: 98, baseType: !51, size: 16, offset: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !141, file: !142, line: 99, baseType: !51, size: 16, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !141, file: !142, line: 100, baseType: !51, size: 16, offset: 48)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !141, file: !142, line: 101, baseType: !98, size: 8, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !141, file: !142, line: 102, baseType: !98, size: 8, offset: 72)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !141, file: !142, line: 103, baseType: !153, size: 16, offset: 80)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !52, line: 31, baseType: !48)
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !141, file: !142, line: 104, baseType: !155, size: 64, offset: 96)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !141, file: !142, line: 104, size: 64, elements: !156)
!156 = !{!157, !162}
!157 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !142, line: 104, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !142, line: 104, size: 64, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !158, file: !142, line: 104, baseType: !130, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !158, file: !142, line: 104, baseType: !130, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !155, file: !142, line: 104, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !142, line: 104, size: 64, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !163, file: !142, line: 104, baseType: !130, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !163, file: !142, line: 104, baseType: !130, size: 32, offset: 32)
!167 = !DILocalVariable(name: "icmp6h", scope: !56, file: !3, line: 243, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !170, line: 8, size: 64, elements: !171)
!170 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !169, file: !170, line: 10, baseType: !98, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !169, file: !170, line: 11, baseType: !98, size: 8, offset: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !169, file: !170, line: 12, baseType: !153, size: 16, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !169, file: !170, line: 63, baseType: !176, size: 32, offset: 32)
!176 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 15, size: 32, elements: !177)
!177 = !{!178, !182, !186, !188, !193, !201}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !176, file: !170, line: 16, baseType: !179, size: 32)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 32, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !176, file: !170, line: 17, baseType: !183, size: 32)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 32, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !176, file: !170, line: 18, baseType: !187, size: 32)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 32, elements: !131)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !176, file: !170, line: 23, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !170, line: 20, size: 32, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !189, file: !170, line: 21, baseType: !51, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !189, file: !170, line: 22, baseType: !51, size: 16, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !176, file: !170, line: 40, baseType: !194, size: 32)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !170, line: 25, size: 32, elements: !195)
!195 = !{!196, !197, !198, !199, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !194, file: !170, line: 27, baseType: !64, size: 5, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !194, file: !170, line: 28, baseType: !64, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !194, file: !170, line: 29, baseType: !64, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !194, file: !170, line: 30, baseType: !64, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !194, file: !170, line: 31, baseType: !64, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !176, file: !170, line: 61, baseType: !202, size: 32)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !170, line: 42, size: 32, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !202, file: !170, line: 43, baseType: !98, size: 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !202, file: !170, line: 45, baseType: !98, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !202, file: !170, line: 46, baseType: !98, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !202, file: !170, line: 47, baseType: !98, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !202, file: !170, line: 48, baseType: !98, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !202, file: !170, line: 49, baseType: !98, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !202, file: !170, line: 60, baseType: !51, size: 16, offset: 16)
!211 = !DILocalVariable(name: "icmph", scope: !56, file: !3, line: 244, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !214, line: 89, size: 64, elements: !215)
!214 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !214, line: 90, baseType: !98, size: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !213, file: !214, line: 91, baseType: !98, size: 8, offset: 8)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !213, file: !214, line: 92, baseType: !153, size: 16, offset: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !213, file: !214, line: 104, baseType: !220, size: 32, offset: 32)
!220 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !213, file: !214, line: 93, size: 32, elements: !221)
!221 = !{!222, !227, !228, !233}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !220, file: !214, line: 97, baseType: !223, size: 32)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !220, file: !214, line: 94, size: 32, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !223, file: !214, line: 95, baseType: !51, size: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !223, file: !214, line: 96, baseType: !51, size: 16, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !220, file: !214, line: 98, baseType: !130, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !220, file: !214, line: 102, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !220, file: !214, line: 99, size: 32, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !229, file: !214, line: 100, baseType: !51, size: 16)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !229, file: !214, line: 101, baseType: !51, size: 16, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !220, file: !214, line: 103, baseType: !187, size: 32)
!234 = !DILocalVariable(name: "tcph", scope: !56, file: !3, line: 245, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !237, line: 25, size: 160, elements: !238)
!237 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !236, file: !237, line: 26, baseType: !51, size: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !236, file: !237, line: 27, baseType: !51, size: 16, offset: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !236, file: !237, line: 28, baseType: !130, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !236, file: !237, line: 29, baseType: !130, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !236, file: !237, line: 31, baseType: !48, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !236, file: !237, line: 32, baseType: !48, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !236, file: !237, line: 33, baseType: !48, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !236, file: !237, line: 34, baseType: !48, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !236, file: !237, line: 35, baseType: !48, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !236, file: !237, line: 36, baseType: !48, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !236, file: !237, line: 37, baseType: !48, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !236, file: !237, line: 38, baseType: !48, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !236, file: !237, line: 39, baseType: !48, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !236, file: !237, line: 40, baseType: !48, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !236, file: !237, line: 55, baseType: !51, size: 16, offset: 112)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !236, file: !237, line: 56, baseType: !153, size: 16, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !236, file: !237, line: 57, baseType: !51, size: 16, offset: 144)
!256 = !DILocalVariable(name: "udph", scope: !56, file: !3, line: 246, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !259, line: 23, size: 64, elements: !260)
!259 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !258, file: !259, line: 24, baseType: !51, size: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !258, file: !259, line: 25, baseType: !51, size: 16, offset: 16)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !259, line: 26, baseType: !51, size: 16, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !258, file: !259, line: 27, baseType: !153, size: 16, offset: 48)
!265 = !DILocalVariable(name: "flag", scope: !56, file: !3, line: 249, type: !59)
!266 = !DILocalVariable(name: "i", scope: !267, file: !3, line: 353, type: !98)
!267 = distinct !DILexicalBlock(scope: !56, file: !3, line: 353, column: 2)
!268 = !DILocalVariable(name: "key", scope: !269, file: !3, line: 355, type: !64)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 354, column: 2)
!270 = distinct !DILexicalBlock(scope: !267, file: !3, line: 353, column: 2)
!271 = !DILocalVariable(name: "filter", scope: !269, file: !3, line: 356, type: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filter", file: !274, line: 124, size: 704, elements: !275)
!274 = !DIFile(filename: "./xdpfw.h", directory: "/opt/web-ebpf-xdp/ebpf-xdp/src", checksumkind: CSK_MD5, checksum: "a4cd2523f7654f0445c9de9faf4c3ff4")
!275 = !{!276, !277, !278, !279, !280, !281, !282, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !300, !324, !332}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !273, file: !274, line: 126, baseType: !64, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !273, file: !274, line: 127, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !273, file: !274, line: 129, baseType: !98, size: 8, offset: 40)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ip_enabled", scope: !273, file: !274, line: 131, baseType: !7, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 48)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "srcip", scope: !273, file: !274, line: 132, baseType: !64, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "dstip", scope: !273, file: !274, line: 133, baseType: !64, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "srcip6", scope: !273, file: !274, line: 135, baseType: !283, size: 128, offset: 128)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !131)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dstip6", scope: !273, file: !274, line: 136, baseType: !283, size: 128, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "do_min_ttl", scope: !273, file: !274, line: 138, baseType: !7, size: 1, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "min_ttl", scope: !273, file: !274, line: 139, baseType: !98, size: 8, offset: 392)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "do_max_ttl", scope: !273, file: !274, line: 141, baseType: !7, size: 1, offset: 400, flags: DIFlagBitField, extraData: i64 400)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "max_ttl", scope: !273, file: !274, line: 142, baseType: !98, size: 8, offset: 408)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "do_min_len", scope: !273, file: !274, line: 144, baseType: !7, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "min_len", scope: !273, file: !274, line: 145, baseType: !48, size: 16, offset: 432)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "do_max_len", scope: !273, file: !274, line: 147, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !273, file: !274, line: 148, baseType: !48, size: 16, offset: 464)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "do_tos", scope: !273, file: !274, line: 150, baseType: !7, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !273, file: !274, line: 151, baseType: !295, size: 8, offset: 488)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !296, line: 24, baseType: !297)
!296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !298, line: 37, baseType: !299)
!298 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!299 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tcpopts", scope: !273, file: !274, line: 153, baseType: !301, size: 96, offset: 512)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcpopts", file: !274, line: 67, size: 96, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !301, file: !274, line: 69, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "do_sport", scope: !301, file: !274, line: 71, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !301, file: !274, line: 72, baseType: !48, size: 16, offset: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "do_dport", scope: !301, file: !274, line: 74, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !301, file: !274, line: 75, baseType: !48, size: 16, offset: 48)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "do_urg", scope: !301, file: !274, line: 77, baseType: !7, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !301, file: !274, line: 78, baseType: !7, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "do_ack", scope: !301, file: !274, line: 80, baseType: !7, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !301, file: !274, line: 81, baseType: !7, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "do_rst", scope: !301, file: !274, line: 83, baseType: !7, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !301, file: !274, line: 84, baseType: !7, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "do_psh", scope: !301, file: !274, line: 86, baseType: !7, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !301, file: !274, line: 87, baseType: !7, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "do_syn", scope: !301, file: !274, line: 89, baseType: !7, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !301, file: !274, line: 90, baseType: !7, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "do_fin", scope: !301, file: !274, line: 92, baseType: !7, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !301, file: !274, line: 93, baseType: !7, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "do_ece", scope: !301, file: !274, line: 95, baseType: !7, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !301, file: !274, line: 96, baseType: !7, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "do_cwr", scope: !301, file: !274, line: 98, baseType: !7, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !301, file: !274, line: 99, baseType: !7, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "udpopts", scope: !273, file: !274, line: 154, baseType: !325, size: 64, offset: 608)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udpopts", file: !274, line: 102, size: 64, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !325, file: !274, line: 104, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "do_sport", scope: !325, file: !274, line: 106, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !325, file: !274, line: 107, baseType: !48, size: 16, offset: 16)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "do_dport", scope: !325, file: !274, line: 109, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !325, file: !274, line: 110, baseType: !48, size: 16, offset: 48)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "icmpopts", scope: !273, file: !274, line: 155, baseType: !333, size: 32, offset: 672)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpopts", file: !274, line: 113, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !333, file: !274, line: 115, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "do_code", scope: !333, file: !274, line: 117, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !333, file: !274, line: 118, baseType: !98, size: 8, offset: 8)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "do_type", scope: !333, file: !274, line: 120, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !274, line: 121, baseType: !98, size: 8, offset: 24)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 176, elements: !343)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!343 = !{!344}
!344 = !DISubrange(count: 22)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 634, type: !347, isLocal: false, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 32, elements: !131)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !3, line: 41, type: !350, isLocal: false, isDefinition: true)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 36, size: 256, elements: !351)
!351 = !{!352, !355, !357, !365}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !3, line: 37, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 192, elements: !88)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !350, file: !3, line: 38, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !3, line: 39, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !274, line: 53, size: 128, elements: !360)
!360 = !{!361, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !359, file: !274, line: 54, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !49, line: 31, baseType: !363)
!363 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !359, file: !274, line: 55, baseType: !362, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !350, file: !3, line: 40, baseType: !366, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 160, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 5)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !372, line: 56, type: !373, isLocal: true, isDefinition: true)
!372 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/opt/web-ebpf-xdp/ebpf-xdp/src", checksumkind: CSK_MD5, checksum: "7422ca06c9dc86eba2f268a57d8acf2f")
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!46, !46, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !372, line: 177, type: !380, isLocal: true, isDefinition: true)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!47, !383, !64, null}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 43, size: 256, elements: !385)
!385 = !{!386, !389, !394, !395}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !384, file: !3, line: 45, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !184)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !384, file: !3, line: 46, baseType: !390, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2560, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 80)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !384, file: !3, line: 47, baseType: !356, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !384, file: !3, line: 48, baseType: !272, size: 64, offset: 192)
!396 = !{i32 7, !"Dwarf Version", i32 5}
!397 = !{i32 2, !"Debug Info Version", i32 3}
!398 = !{i32 1, !"wchar_size", i32 4}
!399 = !{i32 7, !"frame-pointer", i32 2}
!400 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!401 = !DILocation(line: 0, scope: !56)
!402 = !DILocation(line: 225, column: 38, scope: !56)
!403 = !{!404, !405, i64 4}
!404 = !{!"xdp_md", !405, i64 0, !405, i64 4, !405, i64 8, !405, i64 12, !405, i64 16, !405, i64 20}
!405 = !{!"int", !406, i64 0}
!406 = !{!"omnipotent char", !407, i64 0}
!407 = !{!"Simple C/C++ TBAA"}
!408 = !DILocation(line: 225, column: 27, scope: !56)
!409 = !DILocation(line: 225, column: 19, scope: !56)
!410 = !DILocation(line: 226, column: 34, scope: !56)
!411 = !{!404, !405, i64 0}
!412 = !DILocation(line: 226, column: 23, scope: !56)
!413 = !DILocation(line: 226, column: 15, scope: !56)
!414 = !DILocalVariable(name: "nh", arg: 1, scope: !415, file: !3, line: 51, type: !418)
!415 = distinct !DISubprogram(name: "parse_ethhdr", scope: !3, file: !3, line: 51, type: !416, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!416 = !DISubroutineType(types: !417)
!417 = !{!59, !418, !46, !419}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!420 = !{!414, !421, !422, !423, !424}
!421 = !DILocalVariable(name: "data_end", arg: 2, scope: !415, file: !3, line: 52, type: !46)
!422 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !415, file: !3, line: 53, type: !419)
!423 = !DILocalVariable(name: "eth", scope: !415, file: !3, line: 55, type: !81)
!424 = !DILocalVariable(name: "hdrsize", scope: !415, file: !3, line: 56, type: !59)
!425 = !DILocation(line: 0, scope: !415, inlinedAt: !426)
!426 = distinct !DILocation(line: 259, column: 15, scope: !56)
!427 = !DILocation(line: 61, column: 10, scope: !428, inlinedAt: !426)
!428 = distinct !DILexicalBlock(scope: !415, file: !3, line: 61, column: 6)
!429 = !DILocation(line: 61, column: 14, scope: !428, inlinedAt: !426)
!430 = !DILocation(line: 61, column: 6, scope: !415, inlinedAt: !426)
!431 = !DILocation(line: 67, column: 14, scope: !415, inlinedAt: !426)
!432 = !{!433, !434, i64 12}
!433 = !{!"ethhdr", !406, i64 0, !406, i64 6, !434, i64 12}
!434 = !{!"short", !406, i64 0}
!435 = !DILocation(line: 261, column: 6, scope: !56)
!436 = !DILocalVariable(name: "nh", arg: 1, scope: !437, file: !3, line: 70, type: !418)
!437 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !3, file: !3, line: 70, type: !438, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !441)
!438 = !DISubroutineType(types: !439)
!439 = !{!59, !418, !46, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!441 = !{!436, !442, !443, !444}
!442 = !DILocalVariable(name: "data_end", arg: 2, scope: !437, file: !3, line: 71, type: !46)
!443 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !437, file: !3, line: 72, type: !440)
!444 = !DILocalVariable(name: "ip6h", scope: !437, file: !3, line: 74, type: !93)
!445 = !DILocation(line: 0, scope: !437, inlinedAt: !446)
!446 = distinct !DILocation(line: 263, column: 13, scope: !447)
!447 = distinct !DILexicalBlock(scope: !448, file: !3, line: 261, column: 40)
!448 = distinct !DILexicalBlock(scope: !56, file: !3, line: 261, column: 6)
!449 = !DILocation(line: 80, column: 11, scope: !450, inlinedAt: !446)
!450 = distinct !DILexicalBlock(scope: !437, file: !3, line: 80, column: 6)
!451 = !DILocation(line: 80, column: 17, scope: !450, inlinedAt: !446)
!452 = !DILocation(line: 80, column: 15, scope: !450, inlinedAt: !446)
!453 = !DILocation(line: 80, column: 6, scope: !437, inlinedAt: !446)
